Repository: CherokeeLanguage/Action-Imitation-and-Fun-Series
Catalog: 06-Red-Riding-Hood/CAT/red-riding-hood-seven-kids/tm/corpus-nt-bbe.en.utf8.tmx
Source language: en
Languages: chr

source: And another voice from heaven came to my ears, saying, Come out of her, my people, so that you may have no part in her sins and in her punishments.
chr: ᎠᎴ ᏅᏩᏓᎴ ᎩᎶ ᏗᎧᏁᎬ ᎦᎸᎳᏗ ᎠᏆᏛᎦᏅᎩ, ᎯᎠ ᏅᏓᎦᏪᏍᎬᎩ, ᏂᎯ ᏗᏆᏤᎵᎦ ᏴᏫ ᎡᏥᏄᎪᎢ, ᎾᏍᎩ ᎢᏣᏠᏯᏍᏙᏗᏱ ᏂᎨᏒᎾ ᎾᏍᎩ ᎤᏍᎦᏅᏥᏙᎸᎢ, ᎠᎴ ᎾᏍᎩ ᎤᏤᎵ ᎤᏕᏯᏙᏗ ᎨᏒ ᎢᏣᏠᏯᏍᏙᏗᏱ ᏂᎨᏒᎾ.

source: For her sins have gone up even to heaven, and God has taken note of her evil-doing.
chr: ᎤᏍᎦᏅᏥᏙᎸᏰᏃ ᎦᎸᎳᏗ ᎢᏴᏛ ᏭᎷᏨ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᏅᏓᏛ ᎤᏲᏚᎸᏫᏍᏓᏁᎵᏙᎸᎢ.

source: Give to her as she gave, even an increased reward for her works; in the cup which was mixed by her, let there be mixed as much again for herself.
chr: ᎡᏣᎫᏴᏏ ᎾᏍᎩᏯ ᎢᏣᎫᏴᎡᎸᎢ, ᎠᎴ ᏔᎵ ᎢᏳᏩᎫᏗ ᎡᏣᎫᏴᏏ ᎾᏍᎩᏯ ᏚᎸᏫᏍᏓᏁᎸᎢ; ᎤᎵᏍᏈᏗ ᎤᎧᎵᎸᎯ ᎾᏍᎩ ᏔᎵ ᎢᏳᏩᎫᏗ ᎡᏥᎧᎵᎢᏏ.

source: As she gave glory to herself, and became more evil in her ways, in the same measure give her pain and weeping: for she says in her heart, I am seated here a queen, and am no widow, and will in no way see sorrow.
chr: ᎾᏍᎩ ᏂᎦᎥ ᎤᏩᏒ ᎤᏓᎸᏉᏔᏅᎢ ᎠᎴ ᎤᏢᏉᏗ ᎤᏕᏅᎢ, ᎾᏍᎩ ᎢᎦᎢ ᎠᎩᎵᏯ ᎠᎴ ᎤᏲ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒ ᎡᏥᎥᏏ; ᎤᎾᏫᏱᏰᏃ ᎯᎠ ᏂᎦᏪᎭ, ᎠᎩᎬᏫᏳᎯ ᎠᏉᎳ, ᎥᏝ ᎠᏉᏑᎶᏨᎯ ᏱᎩ, ᎥᏝ ᎠᎴ ᎤᏲ ᎠᏓᏅᏓᏗᏍᏗ ᎨᏒ ᏴᎦᏥᎪᏩᏛ.

source: For this reason in one day will her troubles come, death and sorrow and need of food; and she will be completely burned with fire; for strong is the Lord God who is her judge.
chr: ᎾᏍᎩ ᎢᏳᏍᏗ ᎤᏕᏯᏙᏗᏍᎩ ᎨᏒ ᏏᏉᏃ ᎤᎷᎯᏍᏗ ᎨᏎᏍᏗ, ᎠᏲᎱᎯᏍᏗ ᎨᏒ, ᎠᎴ ᏗᏴᎳᏍᏗ ᎨᏒ, ᎠᎴ ᎠᎪᎸ; ᎠᎴ ᎠᎦᎪᎲᏍᏙᏗ ᎨᏎᏍᏗ ᎠᏥᎸ ᎬᏗ; ᎤᎵᏂᎩᏗᏳᏰᏃ ᎤᎬᏫᏳᎯ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᏧᏭᎪᏓᏁᎯ ᏥᎩ.

source: And the kings of the earth, who made themselves unclean with her, and in her company gave themselves up to evil, will be weeping and crying over her, when they see the smoke of her burning,
chr: ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᎠᏁᎯ, ᎾᏍᎩ ᎤᏕᎵᏛ ᏧᎾᏂᏏᏂᏙᎸᎯ ᎨᏒᎢ, ᎠᎴ ᎤᏢᏉᏗ ᎢᏧᎳᎭ ᎤᎾᏕᏅᎯ, ᎾᏍᎩ ᏓᎬᏩᏍᎪᏂᎵ, ᎠᎴ ᎾᏍᎩ ᏅᏓᎦᎵᏍᏙᏔᏂ ᏙᏛᏂᏴᎳᏏ, ᎿᏉ ᎠᏂᎪᎲᎭ ᏚᎦᏒᏍᏛ ᎾᏍᎩ ᎠᎪᎲᏍᎬᎢ,

source: Watching from far away, for fear of her punishment, saying, Sorrow, sorrow for Babylon, the great town, the strong town! for in one hour you have been judged.
chr: ᎢᏅ ᏗᏂᏙᎾᎡᏍᏗ ᎠᏂᏍᎦᎢᎲ ᎠᎩᎵᏲᎬ ᏅᏗᎦᎵᏍᏙᏗᏍᎬᎢ, ᎯᎠ ᎾᏂᏪᏍᎨᏍᏗ, ᎤᏲᏍᏛᏉ, ᎤᏲᏍᏛᏉ, ᎾᏍᎩ Ꮎ ᎡᏆ ᏓᏓᎶᏂ, ᎾᏍᎩ ᎤᎵᏂᎩᏛ ᎦᏚᎲᎢ! ᏑᏟᎶᏛᏉᏰᏃ ᎢᎪᎯᏛ ᏗᏣᏚᎪᏓᏁᏗ ᎨᏒ ᏣᎷᏥᏏ.

source: And the traders of the earth are weeping and crying over her, because no man has any more desire for their goods,
chr: ᎠᏂᏃᏔᏅᎲᏍᎩᏃ ᎡᎶᎯ ᎠᏁᎯ ᏙᏛᎾᏠᏱᎵ ᎠᎴ ᏙᏛᏂᏴᎳᏏ ᏓᎬᏩᏍᎪᏂᎵ ᎾᏍᎩ; ᎥᏝᏰᏃ ᎿᏉ ᎩᎶ ᏱᎬᏩᏂᏩᎯᏎᎭ ᎦᏃᏙᏗ;

source: Gold, and silver, and stones of great price, and jewels, and delicate linen, and robes of purple and silk and red; and perfumed wood, and every vessel of ivory, and every vessel made of fair wood, and of brass, and iron, and stone;
chr: ᎾᏍᎩ ᎠᏕᎸ-ᏓᎶᏂᎨ ᎦᏃᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏕᎸ-ᎤᏁᎬ, ᎠᎴ ᎤᏣᏘ ᏧᎬᏩᎶᏗ ᏅᏯ, ᎠᎴ ᏓᎬᎾ-ᎢᏳᎾᏍᏗ, ᎠᎴ ᎤᏏᏙᎵ ᏙᎴᏛ, ᎠᎴ ᏗᏕᎭᎷᎨᎢ, ᎠᎴ ᏗᏩᎾᎨᎢ, ᎠᎴ ᏗᎩᎦᎨᎢ, ᎠᎴ ᎾᎦᎥ ᏗᎦᎸᏉᏗ ᎠᏓ, ᎠᎴ ᏂᎦᎥ ᏗᏖᎵᏙ ᎧᎹᎹ ᏧᏓᏄᏙᏅᎯ ᏗᎪᏢᏔᏅᎯ, ᎠᎴ ᏂᎦᎥ ᏗᏖᎵᏙ ᎤᏣᏘ ᏧᎬᏩᎶᏗ ᎠᏓ ᏗᎪᏢᏔᏅᎯ, ᎠᎴ ᎥᏣᏱ, ᎠᎴ ᏔᎷᎩᏍᎩ, ᎠᎴ ᎠᏂᏓᏫᏍᎦᎨ ᏅᏯ,

source: And sweet-smelling plants, and perfumes, and wine, and oil, and well crushed grain, and cattle and sheep; and horses and carriages and servants; and souls of men.
chr: ᎠᎴ ᏏᏂᎹᏂ, ᎠᎴ ᏗᎦᏩᏒᎩ, ᎠᎴ ᎠᏠᏁᏗ, ᎠᎴ ᎠᏜ ᎤᎦᎾᏍᏛ ᎦᏩᏒᎩ, ᎠᎴ ᎩᎦᎨ-ᎠᏗᏔᏍᏗ, ᎠᎴ ᎪᎢ, ᎠᎴ ᏩᎾᎨ ᎤᏣᎴᏍᏗ ᎢᏒ, ᎠᎴ ᎤᏣᎴᏍᏗᎤᎦᏛ, ᎠᎴ ᎦᎾᏝᎢ, ᎠᎴ ᎠᏫ-ᎤᏂᏃᏕᏅ, ᎠᎴ ᏐᏈᎵ, ᎠᎴ ᏧᏍᏗ-ᏓᏆᎴᎷ, ᎠᎴ ᏴᏫ-ᏗᎦᎾᏝᎢ, ᎠᎴ ᏴᏫ ᏧᎾᏓᏅᏙ.

source: And the fruit of your soul's desire has gone from you, and all things delicate and shining have come to an end and will never again be seen.
chr: ᎠᎴ ᎤᏓᏔᏅᎯ ᎾᏍᎩ ᏣᏓᏅᏙ ᏧᎬᎥᏍᎬᎩ ᏣᏓᏅᎡᎸ, ᎠᎴ ᏂᎦᎥ ᎤᏢᏉᏗ ᎠᎴ ᏗᎦᎸᏉᏗ ᏥᎨᏒ ᎨᏣᏓᏅᎡᎸ, ᎠᎴ ᎥᏝ ᎿᏉ ᏫᏗᎨᏣᏩᏛᏗ ᏱᎨᏎᏍᏗ.

source: The traders in these things, by which their wealth was increased, will be watching far off for fear of her punishment, weeping and crying;
chr: ᎯᎠ ᎾᏍᎩ ᏧᏓᎴᏛ ᎠᏂᏃᏔᏅᎥᏍᎩ, ᎾᏍᎩ ᏧᏪᏅᎢᏍᏔᏅᎯ, ᎢᏅ ᏗᏂᏙᎾᎡᏍᏗ ᏅᏗᎦᎵᏍᏙᏗᏍᎨᏍᏗ ᎠᎩᎵᏲᎬ ᎠᏂᏍᎦᎢᎲᎢ, ᏓᎾᏠᏱᎮᏍᏗ ᎠᎴ ᏓᏂᏴᎨᏍᏗ,

source: Saying, Sorrow, sorrow for the great town, she who was clothed in delicate linen, and purple, and red; with ornaments of gold and stones of great price and jewels!
chr: ᎠᎴ ᎯᎠ ᎾᏂᏪᏍᎨᏍᏗ, ᎤᏲᏍᏛᏉ, ᎤᏲᏍᏛᏉ, ᎾᏍᎩ Ꮎ ᎡᏆ ᎦᏚᎲ ᎾᏍᎩ ᎤᏏᏙᎵ ᏙᎴᏛ, ᎠᎴ ᏕᎭᎷᎨᎢ, ᎠᎴ ᎩᎦᎨᎢ ᏥᏚᏣᏃᏛᎩ, ᎠᎴ ᎠᏕᎸᏓᎶᏂᎨᎢ, ᎠᎴ ᎤᏣᏘ ᏧᎾᎬᏩᎶᏗ ᏅᏯ, ᎠᎴ ᏓᎬᎾ-ᎢᏳᎾᏍᏗ, ᏥᏚᏣᏃᏛᎩ!

source: For in one hour such great wealth has come to nothing. And every shipmaster, and all who are sailing on the sea, and sailors and all who get their living by the sea, were watching from far away,
chr: ᏑᏟᎶᏛᏉᏰᏃ ᎢᎪᎯᏛ ᎾᏍᎩ ᎢᎦᎢ ᏧᎬᏩᎶᏗ ᎠᏎᏉ ᏂᎦᎵᏍᏔᏂᏛ. ᎠᎴ ᎾᏂᎥ ᎤᏂᎬᏫᏳᏌᏕᎩ ᏥᏳ ᏧᏔᏅ ᏓᏂᏂᏙᎲᎢ, ᎠᎴ ᎾᏂᎥ ᏥᏳᎯ ᎤᎾᏣᎢ, ᎠᎴ ᏥᏳ ᏗᏂᏂᏙᎯ, ᎠᎴ ᎾᏂᎥᏉ ᎠᎺᏉᎯ ᎠᏂᏃᏔᏂᏙᎯ, ᎢᏅ ᏛᏂᏙᎾᎥᎩ,

source: And crying out when they saw the smoke of her burning, saying, What town is like the great town?
chr: ᎠᎴ ᎤᏁᎷᏅᎩ ᎢᏳᏃ ᎤᏂᎪᎲ ᏚᎦᏒᏍᏛ ᎾᏍᎩ ᎠᎪᎲᏍᎬᎢ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎦᏙ ᎤᏍᏗ ᎾᏍᎩᏯ ᎨᏎ ᎾᏍᎩ ᎯᎠ ᎡᏆ ᎦᏚᎲ ᏄᏍᏛᎢ?

source: And they put dust on their heads, and were sad, weeping and crying, and saying, Sorrow, sorrow for the great town, in which was increased the wealth of all who had their ships on the sea because of her great stores! for in one hour she is made waste.
chr: ᏗᏂᏍᎪᎵᏃ ᎪᏍᏚ ᏚᏂᏝᏅᎩ, ᎠᎴ ᎤᏁᎷᏅᎩ ᏓᎾᏠᏱᎲᎢ, ᎠᎴ ᏓᏂᏴᎬᎢ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎤᏲᏍᏛᏉ, ᎤᏲᏍᏛᏉ, ᎾᏍᎩ Ꮎ ᎡᏆ ᎦᏚᎲᎢ, ᎾᎿ ᏧᏁᎿᎢ ᏥᏄᎾᎵᏍᏔᏅᎩ ᏂᎦᏛ ᎠᎺᏉᎯ ᏥᏳ ᏗᏂᏂᏙᎯ, ᏅᏗᎦᎵᏍᏙᏗᏍᎬ ᎤᏣᏘ ᎤᏪᎿᎢᏳ ᎨᏒᎢ, ᏑᏟᎶᏛᏉᏰᏃ ᎢᎪᎯᏛ ᏅᏔ ᎾᎬᏁᎸ.

source: Be glad over her, heaven, and you saints, and Apostles, and prophets; because she has been judged by God on your account.
chr: ᎢᏣᎵᎮᎵᎩ ᎾᏍᎩ ᏄᎵᏍᏓᏁᎸ ᎢᏳᏍᏗ, ᏂᎯ ᎦᎸᎶᎢ ᎠᎴ ᏂᎯ ᎢᏣᏓᏅᏘ ᎠᎴ ᎡᏥᏅᏏᏛ, ᎠᎴ ᎢᏣᏙᎴᎰᏍᎩ; ᎤᏁᎳᏅᎯᏰᏃ ᏂᎯ ᎨᏒ ᎢᏳᏍᏗ ᎾᏍᎩ ᎠᎦᏞᏥ.

source: And a strong angel took up a stone like the great stone with which grain is crushed, and sent it into the sea, saying, So, with a great fall, will Babylon, the great town, come to destruction, and will not be seen any more at all.
chr: ᎤᎵᏂᎩᏛᏃ ᏗᎧᎿᏩᏗᏙᎯ ᏅᏯ ᎤᎩᏒᎩ, ᎤᏔᏅ ᏗᏍᏙᏍᎩ ᏅᏯ ᎾᏍᎩᏯᎢ, ᎠᎺᏉᎯᏃ ᏭᏗᏅᏒᎩ, ᎯᎠ ᏄᏪᏒᎩ, ᎾᏍᎩᏯ ᎬᏍᎦᎢᏍᏓᎩ ᎾᏍᎩ Ꮎ ᎡᏆ ᎦᏚᎲ ᏓᏓᎶᏂ ᎠᏥᏲᏍᏙᏗ ᎨᏎᏍᏗ, ᎥᏝ ᎠᎴ ᎿᏉ ᎬᏩᏛᏗ ᏱᎨᏎᏍᏗ.

source: And the voice of players and makers of music will never again be sounding in you: and no worker, expert in art, will ever again be living in you; and there will be no sound of the crushing of grain any more at all in you;
chr: ᎠᎴ ᏗᎧᏃᎩᏍᏙᏗ ᏗᏂᏃᎩᏍᏗᏍᎩ, ᎠᎴ ᏗᏂᏃᎩᏍᎩ, ᎠᎴ ᎠᏦᏔᏍᏗ ᏗᏂᏃᎩᏍᏗᏍᎩ, ᎠᎴ ᏗᏂᏤᎷᎯᏍᎩ ᎤᎾᏓᏃᏴᎵᏍᏛ ᎥᏝ ᎿᏉ ᎡᏣᏛᎦᏁᏗ ᏱᎨᏎᏍᏗ; ᎢᏝ ᎠᎴ ᎪᏢᏅᎥᏍᎩ ᏄᏓᎴᏒᏉ ᎪᎱᏍᏗ ᎪᏢᏍᎩ ᎿᏉ ᏰᏣᏩᏛᎡᎴᏍᏗ; ᎠᎴ ᏅᏯ ᎠᏍᏙᏍᎩ ᎤᏃᏴᎬ ᎥᏝ ᎿᏉ ᎡᏣᏛᎦᏁᏗ ᏱᎨᏎᏍᏗ;

source: And never again will the shining of lights be seen in you; and the voice of the newly-married man and the bride will never again be sounding in you: for your traders were the lords of the earth, and by your evil powers were all the nations turned out of the right way.
chr: ᎠᎴ ᎠᏨᏍᏙᏗ ᏚᎸᏌᏛ ᎥᏝ ᎿᏉ ᏗᏣᎸᏌᏓᏕᏗ ᏱᎨᏎᏍᏗ; ᎠᎴ ᎠᏕᏒᎲᏍᎩ ᎠᎴ ᎠᏥᏰᎯ ᎠᏂᏁᎬ ᎥᏝ ᎿᏉ ᎡᏣᏛᎦᏁᏗ ᏱᎨᏎᏍᏗ; ᏗᏣᏤᎵᏰᏃ ᎠᏂᏃᏗᏍᎩ ᎨᏥᎸᏉᏗ ᎨᏒᎩ ᏴᏫ ᎡᎶᎯ ᏓᏁᏩᏗᏒᎢ; ᏂᎦᏗᏳᏰᏃ ᎤᎾᏓᏤᎵᏛ ᎨᏒ ᏴᏫ ᏓᏁᏩᏗᏒ ᎠᏙᏅᏗ ᏕᏣᎸᏫᏍᏓᏁᎲ ᏕᎯᎶᏄᎮᏔᏅᎩ.

source: And in her was seen the blood of prophets and of saints, and of all who have been put to death on the earth.
chr: ᎠᎴ ᎾᏍᎩ ᎠᏥᏩᏛᎡᎸᎩ ᎤᏂᎩᎬ ᎠᎾᏙᎴᎰᏍᎩ, ᎠᎴ ᎤᎾᏓᏅᏘ, ᎠᎴ ᏂᎦᏛ ᎡᎶᎯ ᏗᎨᏥᎸᎯ ᎨᏒᎢ.

source: After these things there came to my ears a sound like the voice of a great band of people in heaven, saying, Praise to the Lord; salvation and glory and power be to our God:
chr: ᎾᏍᎩᏃ ᏄᎵᏍᏔᏂᏙᎸ ᎠᏆᏛᎦᏅᎩ ᎠᏍᏓᏯ ᎠᏂᏁᎬ ᎤᏂᏣᏘ ᏴᏫ ᎦᎸᎳᏗ ᎢᏴᏛ, ᎯᎠ ᏅᏛᏂᏪᏍᎬᎩ, ᏱᎰᏩ ᎡᏗᎸᏉᏓ; ᎠᎵᏍᏕᎸᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎠᏥᎸᏉᏙᏗ ᎨᏒᎢ, ᎠᎴ ᎣᏍᏛ ᎠᏥᏰᎸᏗ ᎨᏒᎢ, ᎠᎴ ᎤᎵᏂᎩᏛ ᎨᏒᎢ, ᎤᏤᎵᎦ ᎨᏎᏍᏗ ᎤᎬᏫᏳᎯ ᎢᎦᏁᎳᏅᎯ;

source: For true and upright are his decisions; for by him has the evil woman been judged, who made the earth unclean with the sins of her body; and he has given her punishment for the blood of his servants.
chr: ᎾᏍᎩᏰᏃ ᏧᏭᎪᏙᏗ ᎨᏒ ᏚᏳᎪᏛᎢ ᎠᎴ ᎣᏍᏛ; ᎾᏍᎩᏰᏃ ᏚᏭᎪᏓᏁᎸ ᎤᏣᏘ ᎤᏁᎫᏥᏛ ᎠᎨᏴ, ᎾᏍᎩ ᎤᏕᎵᏛ ᏓᏂᏏᏂᏙᎲ ᎤᏂᏲ ᏥᏂᏚᏩᏁᎸ ᎡᎶᎯ ᎠᏁᎯ, ᎠᎴ ᎤᏞᏨ ᏧᏅᏏᏓᏍᏗ ᎤᏂᎩᎬ ᏚᏨᏁᎸᎢ.

source: And again they said, Praise to the Lord. And her smoke went up for ever and ever.
chr: ᎠᎴ ᏔᎵᏁ ᏱᎰᏩ ᎡᏗᎸᏉᏓ ᎤᎾᏛᏅᎩ. ᎠᎴ ᎾᏍᎩ ᎤᏤᎵ ᏧᎦᏒᏍᏗ ᏓᎴᎲᏍᎬᎩ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸᎢ.

source: And the four and twenty rulers and the four beasts went down on their faces and gave worship to God who was seated on the high seat, saying, Even so, praise to the Lord.
chr: ᎾᏍᎩᏃ Ꮎ ᏅᎩᏦᏁ ᎢᏯᏂᏛ ᏧᎾᏛᏐᏅᎯ, ᎠᎴ Ꮎ ᏅᎩ ᎢᏯᏂᏛ ᏗᏅᏃᏛ ᎡᎳᏗ ᏚᎾᏓᏅᏅᎩ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎩ, ᎾᏍᎩ ᎦᏍᎩᎸ ᎤᏪᎵ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᎡᎺᏅ; ᏱᎰᏩ ᎡᏗᎸᏉᏓ.

source: And a voice came from the high seat, saying, Give praise to our God, all you his servants, small and great, in whom is the fear of him.
chr: ᎠᎴ ᎩᎶ ᎧᏁᎬ ᎦᏍᎩᎸ ᏓᏳᏓᎴᏅᎩ, ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎡᏥᎸᏉᏓ ᎣᎦᏁᎳᏅᎯ ᏂᎯ ᏂᏥᎥ ᎢᏥᏅᏏᏓᏍᏗ ᏥᎩ, ᎠᎴ ᏂᎯ ᎡᏥᎾᏰᏍᎩ ᏥᎩ, ᏗᏣᏍᏗᎦ ᎠᎴ ᏗᏣᏔᏅ.

source: And there came to my ears the voice of a great army, like the sound of waters, and the sound of loud thunders, saying, Praise to the Lord: for the Lord our God, Ruler of all, is King.
chr: ᎠᎴ ᎠᏆᏛᎦᏅᎩ ᎤᏂᏣᏘ ᏣᏂᏁᎪ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎤᏣᏘ ᎠᎹ ᏧᏍᏆᏃᏴᎪ ᎾᏍᎩᏯᎢ, ᎠᎴ ᎤᏣᏘ ᏓᏴᏓᏆᎶᏍᎬ ᏥᏚᏍᏆᏃᏴᎪ ᎾᏍᎩᏯᎢ, ᎯᎠ ᎾᏂᏪᏍᎬᎩ, ᏱᎰᏩ ᎡᏗᎸᏉᏓ; ᎤᎬᏫᏳᎯᏰᏃ ᎤᏁᎳᏅᎯ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ ᎤᎬᏫᏳᏌᏕᎦ.

source: Let us be glad with delight, and let us give glory to him: because the time is come for the Lamb to be married, and his wife has made herself ready.
chr: ᎣᏍᏛ ᎢᏓᏓᏅᏓᏓ ᎠᎴ ᎢᏓᎵᎮᎵᎩ, ᎠᎴ ᎾᏍᎩ ᎡᏗᎸᏉᏓ; ᎤᏃᏕᎾᏰᏃ-ᎠᎩᎾ ᏣᎦᏨᏍᏙᏗᏱ ᎠᏍᏆᎸ, ᎤᏓᎵᎢᏃ ᎠᏛᏅᎢᏍᏔᏃᎾ.

source: And to her it was given to be clothed in delicate linen, clean and shining: for the clean linen is the righteousness of the saints.
chr: ᎠᎴ ᎾᏍᎩ ᎠᎦᎵᏍᎪᎸᏓᏁᎸᎩ ᎤᏏᏙᎵ ᏙᎴᏛ ᏧᏄᏬᏍᏗᏱ, ᏗᎦᏓᎭ ᏂᎨᏒᎾ ᎠᎴ ᏧᏁᎬ; ᎤᏏᏙᎵᏰᏃ ᏙᎴᏛ ᏚᏳᎪᏛ ᏄᎾᏛᏁᎵᏙᎸ ᎤᎾᏓᏅᏘ ᎦᏛᎦ.

source: And he said to me, Put in the book, Happy are the guests at the bride-feast of the Lamb. And he said to me, These are the true words of God.
chr: ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᎰᏪᎸᎦ, (ᎯᎠᏅᎦ,) ᎣᏏᏳ ᎢᏳᎾᎵᏍᏓᏁᏗ ᎾᏍᎩ Ꮎ ᎤᏃᏕᎾ-ᎠᎩᎾ ᏣᎦᏨᏍᏙᏗᏱ ᏧᎾᎵᏍᏓᏴᏗᏱ ᎨᏒ ᎤᏂᎷᎯᏍᏗᏱ ᎨᏥᏯᏅᏛ ᎨᏎᏍᏗ. ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᎯᎠ ᎾᏍᎩ ᎤᏙᎯᏳᎯ ᎢᏳᏪᏛ ᎤᏁᎳᏅᎯ.

source: And I went on my face before his feet to give him worship. And he said to me, See you do it not: I am a brother-servant with you and with your brothers who keep the witness of Jesus: give worship to God: for the witness of Jesus is the spirit of the prophet's word.
chr: ᏚᎳᏍᎬᏃ ᎠᏆᏓᏅᏅᎩ ᏓᏥᏯᏓᏙᎵᏍᏓᏁᎵᏒᎩ. ᎯᎠᏃ ᎾᎩᏪᏎᎸᎩ, ᎥᏞᏍᏗ. ᎠᏴᏰᏃ ᎤᏠᏱᏉ ᎡᎩᏂᏅᏏᏓᏍᏗ, ᎠᎴ ᎠᏴ ᎾᏍᎩ ᎢᏣᎵᏅᏟ ᏥᎨᏒ ᎾᏍᎩ ᏥᏌ ᎤᏤᎵ ᎪᎯᏳᏗᏍᎩ ᎤᏂᎯ; ᎤᏁᎳᏅᎯ ᎯᏯᏓᏙᎵᏍᏓᏏ; ᎠᏙᎴᎰᎯᏍᏙᏗᏰᏃ ᎨᏒ ᎠᏓᏅᏙ ᎠᎴ ᏥᏌ ᎪᎯᏳᏓᏁᏗᏱ ᎤᏠᏱᏉ.

source: And the heaven was open; and I saw a white horse, and he who was seated on it was named Certain and True; and he is judging and making war in righteousness.
chr: ᎠᎩᎪᎲᎩᏃ ᎦᎸᎶᎢ ᎤᎵᏍᏚᎢᏛ ᎨᏒᎩ, ᎠᎴ ᎬᏂᏳᏉ ᎤᏁᎬ ᏐᏈᎵ (ᎥᏥᎪᎥᎩ;) ᎠᎴ ᎾᏍᎩ ᎾᎿ ᎤᎩᎵ, ᏄᏓᎵᏓᏍᏛᎾ ᎠᎴ ᏚᏳᎪᏛ (ᎢᏯᏛᏁᎯ) ᎠᎪᏎᎲᎩ, ᎠᎴ ᏚᏳᎪᏛ ᎬᏗᏍᎬ ᏕᎫᎪᏗᎭ ᎠᎴ ᏓᎿᏩ ᎪᏢᏍᎦ.

source: And his eyes are a flame of fire, and crowns are on his head; and he has a name in writing, of which no man has knowledge but himself.
chr: ᏗᎦᏙᎵ ᎠᏥᎸ ᎠᏓᏪᎵᎩᏍᎩ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎠᏍᎪᎵᏃ ᎤᏣᏘ ᏚᎵᏍᏚᎸᎩ; ᎠᎴ ᏚᏙᎥ ᎪᏪᎸᎩ ᎾᏍᎩ ᎩᎶ ᎬᏬᎵᏍᏗ ᏂᎨᏒᎾ ᎤᏩᏒᏍᎩᏂᏃᏅ ᎪᎵᎬᎩ.

source: And he is clothed in a robe washed with blood: and his name is The Word of God.
chr: ᎠᎴ ᎩᎬᎯ ᎬᏅᎯ ᎠᏄᏬ ᎤᏄᏩᎥᎩ; ᎠᎴ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎧᏃᎮᏛ ᎠᎪᏎᎭ ᎠᏥᏯᏂᏍᎬᎢ.

source: And the armies which are in heaven went after him on white horses, clothed in delicate linen, white and clean.
chr: ᎠᎴ ᎠᏂᏯᏫᏍᎩ ᎦᎸᎳᏗ ᎠᏁᎲ ᎬᏩᏍᏓᏩᏛᏒᎩ ᎤᏂᏁᎬ ᏐᏈᎵ ᏧᎾᎩᎸᏗ, ᏧᏏᏙᎵ ᏙᎴᏛ ᏗᏄᏬ ᏚᎾᏄᏬᏍᏛᎩ, ᏧᏁᎬ ᎠᎴ ᏗᎦᏓᎭ ᏂᎨᏒᎾ.

source: And out of his mouth comes a sharp sword, with which he overcomes the nations: and he has rule over them with a rod of iron: and he is crushing with his feet the grapes of the strong wrath of God the Ruler of all.
chr: ᎠᎴ ᎠᎰᎵ ᏗᎦᏄᎪᎦ ᎪᏍᏓᏯ ᎭᏰᎳᏍᏗᎦᏅᎯᏛ, ᎾᏍᎩ ᏧᏩᏂᏍᏙᏗᏱ ᎤᎾᏓᏤᎵᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ; ᎠᎴ ᏔᎷᎩᏍᎩ ᎬᏗ ᏗᎬᏩᏁᎶᏙᏗᏱ ᏅᏓᎬᏁᎵ; ᎠᎴ ᏖᎸᎳᏗ ᎦᏨᏩᏍᏙᏗᏱ ᎠᎳᏍᏓᎡᎭ ᎾᏍᎩ ᎤᏓᏑᏱ ᎤᏍᎦᏎᏗ ᎠᎴ ᎤᏔᎳᏬᎯᏍᏗ ᎨᏒ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ.

source: And on his robe and on his leg is a name, KING OF KINGS, AND LORD OF LORDS.
chr: ᎠᎴ ᎤᏄᏬᎩᎯ ᎠᎴ ᎦᎦᎶᎢ ᏧᏙᏍᏙᏗ ᎪᏪᎸᎩ, (ᎯᎠ ᏂᎬᏅᎩ,) ᏄᏂᎬᏫᏳᏌᏕᎩ ᎠᏁᎲ ᏄᎬᏫᏳᏌᏕᎩ, ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎠᏁᎲ ᎤᎬᏫᏳᎯ.

source: And I saw an angel taking his place in the sun; and he was crying with a loud voice, saying to all the birds in flight in the heavens, Come together to the great feast of God;
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎥᏥᎪᎥᎩ ᏅᏙ ᎢᎦᎡᎯ ᎧᎸ ᎬᏙᎬᎩ; ᎠᎴ ᎤᏪᎷᏅᎩ ᎠᏍᏓᏯ ᎤᏁᏨᎩ, ᎯᎠ ᏂᏚᏪᏎᎸᎩ ᎾᎯᎥ ᏥᏍᏆ ᎦᎸᎶ ᎠᏰᎵ ᎠᏂᏃᎯᎵᏙᎯ, ᎡᏤᎾ ᎢᏣᏓᏟᏌ ᎠᏥᎸᏉᏗ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎠᎵᏍᏓᏴᏗᏱ ᎨᏒᎢ;

source: So that you may take for your food the flesh of kings, and of captains, and of strong men, and of horses and of those who are seated on them, and the flesh of all men, free and unfree, small and great.
chr: ᎾᏍᎩ ᎢᏥᎩᏍᏗᏱ ᎤᏂᎬᏫᏳᎯ ᎤᏂᏇᏓᎸᎢ, ᎠᎴ ᎠᏂᏍᎦᏰᎬᏍᏓ ᎤᏂᏇᏓᎸᎢ, ᎠᎴ ᏧᎾᎵᏂᎩᏛ ᎠᏂᏍᎦᏯ ᎤᏂᏇᏓᎸᎢ, ᎠᎴ ᏐᏈᎵ ᎤᏂᏇᏓᎸᎢ, ᎠᎴ ᎾᏍᎩ Ꮎ ᏧᎾᎩᎸᏗ, ᏂᏗᎨᏥᎾᏝᎥᎾ ᎠᎴ ᏗᎨᏥᎾᏝᎢ, ᎾᏍᏉ ᏧᎾᏍᏗ ᎠᎴ ᏧᎾᏔᏅ.

source: And I saw the beast, and the kings of the earth, and their armies, come together to make war against him who was seated on the horse and against his army.
chr: ᎠᎴ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎥᏥᎪᎥᎩ, ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎡᎶᎯ ᏓᏁᏩᏗᏒᎢ, ᎠᎴ ᎾᏍᎩ ᏧᎾᏤᎵ ᎠᏂᏯᏫᏍᎩ, ᎤᎾᏓᏟᏌᏅᎩ ᏓᎿᏩ ᎢᏳᏅᏁᏗᏱ ᎤᏂᏰᎸᏒᎩ ᎾᏍᎩ Ꮎ ᏐᏈᎵᎯ ᎤᎩᎵ, ᎠᎴ ᎾᏍᎩ ᏧᏤᎵ ᎠᏂᏯᏫᏍᎩ.

source: And the beast was taken, and with him the false prophet who did the signs before him, by which they were turned from the true way who had the mark of the beast, and who gave worship to his image: these two were put living into the sea of ever-burning fire.
chr: ᏅᎩᏃ-ᏗᎦᏅᏌᏗ ᎠᏥᏴᎩᏅᎩ, ᎠᎴ ᎠᎦᏠᏯᏍᏔᏅᎩ ᎤᏠᎾᏍᏗ ᎠᏙᎴᎰᏍᎩ ᎾᏍᎩ ᎠᎦᏔᎲ ᎤᏍᏆᏂᎪᏗ ᏥᏚᎸᏫᏍᏓᏁᎲᎩ, ᎾᏍᎩ ᏥᏕᎦᎶᏄᎮᏗᏍᎬᎩ ᎾᏍᎩ Ꮎ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎤᏤᎵ ᎤᏓᏰᎸᏙᏗ ᏗᎨᏥᏰᎸᏔᏅᎯ, ᎠᎴ ᎾᏍᎩ Ꮎ ᏣᎦᏟᎶᏍᏔᏅᎯ ᎠᎾᏓᏙᎵᏍᏓᏁᎯ. ᎯᎠ ᎾᏍᎩ ᎢᏧᎳ ᏗᎬᏅᏃᏛ ᏫᏕᎨᎦᏓᎢᏅᏒᎩ ᎠᏥᎸ ᏨᏓᎸ ᎾᎿ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ ᏗᏓᏪᎳᎩᏍᎬᎢ.

source: And the rest were put to death with the sword of him who was on the horse, even the sword which came out of his mouth: and all the birds were made full with their flesh.
chr: ᎤᎾᎵᏃᎯᏴᎯᏃ ᎭᏰᎳᏍᏗ-ᎦᏅᎯᏛ ᏐᏈᎵᎯ ᎤᎩᎵ ᎤᏤᎵᎦ ᏕᎨᏥᎢᏍᏔᏅᎩ, ᎾᏍᎩ ᎠᎰᎵ ᏨᏓᎦᏄᎪᎬᎩ; ᏂᎦᏛᏃ ᏥᏍᏆ ᎾᏍᎩ ᎤᏂᏇᏓᎸ ᏚᏃᎸᎯᏍᏔᏅᎩ.

source: And I saw an angel coming down out of heaven, having the key of the great deep and a great chain in his hand.
chr: ᏗᎧᎿᏩᏗᏙᎯᏃ ᎥᏥᎪᎥᎩ ᎦᎸᎳᏗ ᏓᏳᏠᎠᏒᎩ, ᎦᏁᎲᎩ ᎠᏍᏚᎢᏍᏗ ᏫᎾᏍᏛᎾ ᎠᏔᎴᏒᎢ, ᎠᎴ ᎤᏣᏘ ᎡᏆ ᏧᏓᏕᏒᏛ ᎤᏒᎦᎸᎩ.

source: And he took the dragon, the old snake, which is the Evil One and Satan, and put chains on him for a thousand years,
chr: ᎤᏂᏴᎲᎩᏃ ᎢᎾᏛ, ᎾᏍᎩ ᎠᎦᏴᎵ ᎢᎾᏛ, ᎾᏍᎩ ᎠᏍᎩᎾ ᎠᎴ ᏎᏓᏂ ᏣᎪᏎᎰᎢ, ᏌᏉᏃ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᎠᎦᎸᎸᎩ,

source: And put him into the great deep, and it was shut and locked over him, so that he might put the nations in error no longer, till the thousand years were ended: after this he will be let loose for a little time.
chr: ᎠᎴ ᏫᎾᏍᏛᎾ ᏗᏔᎴᏒ ᏩᎦᏓᎢᏅᏒᎩ, ᎠᎴ ᎠᏥᏍᏚᏅᎩ, ᎠᎴ ᎤᏰᎸᏔᏅᎩ ᎠᏍᏚᎲᎢ, ᎾᏍᎩ ᏗᎬᏩᎶᏄᎮᏗ ᎿᏉ ᏂᎨᏒᎾ ᎢᏳᎵᏍᏙᏗᏱ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᏓᏁᏩᏗᏒᎢ, ᎬᏂ ᏌᏉ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᏳᎶᏐᏅ; ᎣᏂᏃ ᎿᏉ ᎠᏥᎪᏗ ᎢᎨᏎᏍᏗ ᏞᎦ.

source: And I saw high seats, and they were seated on them, and the right of judging was given to them: and I saw the souls of those who were put to death for the witness of Jesus, and for the word of God, and those who did not give worship to the beast, or to his image, and had not his mark on their brows or on their hands; and they were living and ruling with Christ a thousand years.
chr: ᎠᎴ ᏓᎩᎪᎲ ᏕᎦᏍᎩᎸᎢ, ᎾᎿᏃ ᎤᎾᏅᏅᎩ ᎠᎴ ᏧᏄᎪᏙᏗᏱ ᎥᎨᎦᎵᏍᎪᎸᏓᏁᎸᎩ; ᎠᎴ ᏙᏥᎪᎥᎩ ᏧᎾᏓᏅᏙ ᏗᎨ ᏥᏍᎫᏕᏒᎯ ᎾᏍᎩ ᏥᏌ ᎠᏂᏃᎮᏍᎬ ᎤᏂᏍᏛᏛᎯ ᎠᎴ ᎧᏃᎮᏛ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎠᏂᏃᎮᏍᎬᎢ, ᎠᎴ ᎾᏍᎩ ᎤᎾᏓᏙᎵᏍᏓᏁᎸᎯ ᏂᎨᏒᎾ ᏅᎩ-ᏗᎦᏅᏌᏗ, ᎠᎴ ᎾᏍᎩ ᏣᎦᏟᎶᏍᏔᏅᎯ, ᎠᎴ ᏗᎨᎪᏪᎳᏅᎯ ᏂᎨᏒᎾ ᏗᏂᎬᏓᎨᏂ, ᎠᎴ ᏧᏃᏰᏂ; ᎠᎴ ᎾᏍᎩ ᎦᎶᏁᏛ ᎢᏧᎳᎭ ᎠᏁᎲᎩ ᎠᎴ ᎤᏂᎬᏫᏳᎯ ᎥᎨᏒᎩ ᏌᏉ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ.

source: The rest of the dead did not come to life again till the thousand years were ended. This is the first coming back from the dead.
chr: ᎠᏂᏐᎢᏍᎩᏂ ᏧᏂᏲᎱᏒᎯ ᎥᏝ ᏯᏁᎮ ᎬᏂ ᏌᏉ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᏚᎶᏐᏅ. ᎯᎠ ᎾᏍᎩ ᎢᎬᏱᏱ ᏗᎴᎯᏐᏗ ᎨᏒᎢ.

source: Happy and holy is he who has a part in this first coming: over these the second death has no authority, but they will be priests of God and of Christ, and will be ruling with him a thousand years.
chr: ᎣᏏᏳ ᎢᏳᎵᏍᏓᏁᏗ ᎠᎴ ᎾᏍᎦᏅᎾ ᎾᏍᎩ Ꮎ ᎤᏪᎳᏗᏍᏗᏍᎩ ᎢᎬᏱᏱ ᏗᎴᎯᏐᏗ ᎨᏒᎢ; ᎾᏍᎩ ᎥᏝ ᎪᎱᏍᏗ ᏴᎬᏩᏅᎦ ᏔᎵᏁ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ, ᎠᏥᎸᏍᎩᏂ-ᏗᏁᎶᎯ ᎨᏎᏍᏗ ᎤᏁᎳᏅᎯ ᎠᎴ ᎦᎶᏁᏛ, ᎠᎴ [ᎦᎶᏁᏛ] ᎢᏧᎳᎭ ᎤᏂᎬᏫᏳᎯ ᎨᏎᏍᏗ ᏌᏉ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ.

source: And when the thousand years are ended, Satan will be let loose out of his prison,
chr: ᏌᏉᏃ ᎢᏯᎦᏴᎵ ᎢᏧᏕᏘᏴᏛ ᎦᎶᏐᏅ, ᏎᏓᏂ ᏛᎠᏥᎧᏂ ᏛᎠᏥᏄᎪᏫᏏ ᎠᏥᏍᏚᎲᎢ;

source: And will go out to put in error the nations which are in the four quarters of the earth, Gog and Magog, to get them together to the war, the number of whom is like the sands of the sea.
chr: ᎠᎴ ᏛᎡᏙᎵ ᏧᎶᏄᎮᏗᏱ ᏧᎾᏓᎴᏅᏛ ᏴᏫ ᎾᏍᎩ ᏅᎩ ᏂᏚᏓᎠᏗᏒ ᏓᏁᏩᏗᏒᎢ ᎡᎶᎯ ᏣᏁᎭ ᎾᏍᎩ ᎪᎦ ᎠᎴ ᎺᎪᎦ, ᎾᏍᎩ ᏧᏪᏟᏐᏗᏱ ᏧᎾᎵᏍᏗᏱ; ᎾᏂᎥᏃ ᏃᏳ ᎠᎺᏉᎯ ᎠᎲ ᎾᏂᎥ.

source: And they went up over the face of the earth, and made a circle about the tents of the saints, and the well loved town: and fire came down out of heaven for their destruction.
chr: ᎠᎴ ᏂᎬᎾᏛ ᎡᎶᎯ ᎤᏁᏙᎸᎩ, ᎠᎴ ᏚᎾᏚᏫᏍᏔᏅᎩ ᎠᏂᏅ ᎤᎾᏓᏅᏘ, ᎠᎴ ᎣᏍᏛ ᎠᏰᎸᏗ ᎦᏚᎲᎢ; ᎠᏥᎸᏃ ᎤᎯᎳᏅᎯᏱ ᎦᎸᎳᏗ ᏛᎤᎶᏒᎩ ᎠᎴ ᏚᏂᎰᏅᎩ.

source: And the Evil One who put them in error was sent down into the sea of ever-burning fire, where the beast and the false prophet are, and their punishment will go on day and night for ever and ever.
chr: ᎠᏍᎩᎾᏃ ᎾᏍᎩ ᎤᏂᎶᏄᎮᎸᎯ ᎠᏥᎸ ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎳᎩᏍᎩ ᎥᏓᎸ ᏩᎦᏓᎢᏅᏒᎩ, ᎾᎿ ᎠᏁᎲ ᏅᎩ-ᏗᎦᏅᏌᏗ ᎠᎴ ᎤᏠᎾᏍᏗ ᎠᏙᎴᎰᏍᎩ, ᎠᎴ ᎨᏥᎩᎵᏲᎢᏍᏙᏗ ᎨᏎᏍᏗ ᏂᎪᎯᎸ ᎠᎴ ᏂᎪᎯᎸᎢ.

source: And I saw a great white seat, and him who was seated on it, before whose face the earth and the heaven went in flight; and there was no place for them.
chr: ᎠᎴ ᎠᎩᎪᎲᎩ ᎡᏆ ᎤᏁᎬ ᎦᏍᎩᎶ, ᎠᎴ ᎾᏍᎩ ᎾᎿ ᎤᏬᎵ, ᎾᏍᎩ ᎤᎧᏛᎢ ᎡᎶᎯ ᎠᎴ ᎦᎸᎶᎢ ᎬᏩᎵᎡᎸᎩ, ᎥᏝ ᎠᎴ ᎢᎸᎯᏢ ᎬᏩᎵᎡᎸᎩ, ᎥᏝ ᎠᎴ ᎢᎸᎯᏢ ᎬᏩᏛᏗ ᏱᎨᏎ ᏭᏂᎶᎯᏍᏗᏱ.

source: And I saw the dead, great and small, taking their places before the high seat; and the books were open, and another book was open, which is the book of life; and the dead were judged by the things which were in the books, even by their works.
chr: ᎠᎴ ᏧᏂᏲᎱᏒᎯ ᎥᎦᏥᎪᎥᎩ, ᏧᎾᏍᏗ ᎠᎴ ᏧᎾᏛᎾ, ᎤᏁᎳᏅᎯ ᎤᏬᎸ ᎢᎬᏱᏗᏢ ᏚᎾᎴᏅᎩ; ᎪᏪᎵᏃ ᏚᏂᏍᏚᎢᏒᎩ; ᎠᎴ ᏅᏩᏓᎴ ᎪᏪᎵ ᎤᏂᏍᏚᎢᏒᎩ, ᎾᏍᎩ ᎬᏂᏛ ᎠᏓᏁᎯ ᏥᎩ; ᏧᏂᏲᎱᏒᎯᏃ ᏙᎨᎫᎪᏓᏁᎸᎩ ᎾᏍᎩᏯ ᏂᎬᏅ ᎪᏪᎸ ᎪᏪᎵᎯ, ᎾᏍᎩᏯ ᏄᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ.

source: And the sea gave up the dead which were in it; and death and Hell gave up the dead which were in them; and they were judged every man by his works.
chr: ᎠᎺᏉᎯᏃ ᏚᏲᏒᎩ ᏧᏂᏲᎱᏒᎯ ᎾᎿ ᏄᎾᏛᏅᎢ; ᎠᏲᎱᎯᏍᏗᏃ ᎠᎴ ᏨᏍᎩᏃ ᏚᏂᏲᏒ ᏧᏂᏲᎱᏒᎯ ᎾᎿ ᎠᏁᎲᎢ; ᎠᎴ ᏕᎨᎫᎪᏓᏁᎸᎩ ᏂᎦᏗᏳ ᎠᏂᏏᏴᏫᎭ ᎾᏍᎩᏯ ᏄᏍᏛ ᏚᏂᎸᏫᏍᏓᏁᎸᎢ.

source: And death and Hell were put into the sea of fire. This is the second death, even the sea of fire.
chr: ᎠᏲᎱᎯᏍᏗᏃ ᎨᏒ ᎠᎴ ᏨᏍᎩᏃ ᎠᏥᎸ ᏨᏓᎸ ᏫᏕᎨᎦᏓᎢᏅᏒᎩ. ᎯᎠ ᎾᏍᎩ ᏔᎵᏁ ᎠᏲᎱᎯᏍᏗ ᎨᏒᎢ.

source: And if anyone's name was not in the book of life, he went down into the sea of fire.
chr: ᎾᏂᎥᏃ ᎩᎶ (ᏚᎾᏙᎥ) ᏂᏗᎪᏪᎸᎾ ᎨᏒ ᎯᎠ ᎾᏍᎩ ᎬᏂᏛ ᎠᏓᏁᎯ ᎪᏪᎵᎯ, ᏫᏕᎨᎦᏓᎢᎡᎬᎩ ᎠᏥᎸ ᏨᏓᎸᎢ.

source: And I saw a new heaven and a new earth: for the first heaven and the first earth were gone; and there was no more sea.
chr: ᏓᎩᎪᎲᎩᏃ ᎢᏤ ᎦᎸᎶᎢ ᎠᎴ ᎢᏤ ᎦᏙᎯ; ᎢᎬᏱᏱᏰᏃ ᎦᎸᎶᎢ ᎠᎴ ᎢᎬᏱᏱ ᎦᏙᎯ ᏥᎨᏒᎩ ᎤᏂᎶᏐᏅᎩ; ᎠᎴ ᎥᏝ ᎿᏉ ᎠᎺᏉᎯ ᏱᎨᏎᎢ.

source: And I saw the holy town, new Jerusalem, coming down out of heaven from God, like a bride made beautiful for her husband.
chr: ᎠᎴ ᎠᏴ ᏣᏂ ᎠᎩᎪᎲᎩ ᎦᎸᏉᏗᏳ ᎦᏚᎲ ᎾᏍᎩ ᎢᏤ ᏥᎷᏏᎵᎻ ᏓᏳᏠᎠᏒᎩ ᎤᏁᎳᏅᎯᏱ ᎦᎸᎶᎢ, ᎤᏛᏅᎢᏍᏛᎩ ᎾᏍᎩᏯ ᎠᏥᏰᎯ ᏣᏙᏚᎢᏍᏗᏍᎪ ᏣᏛᏅᎢᏍᏓᏁᎰ ᎤᏰᎯ.

source: And there came to my ears a great voice out of the high seat, saying, See, the Tent of God is with men, and he will make his living-place with them, and they will be his people, and God himself will be with them, and be their God.
chr: ᎠᏆᏛᎦᏅᎩᏃ ᎠᏍᏓᏯ ᎧᏁᎬ ᎩᎶ ᎦᎸᎳᏗ ᏛᏓᎴᎲᏍᎬᎩ ᎯᎠ ᏂᎦᏪᏍᎬᎩ, ᎬᏂᏳᏉ ᎤᏁᎳᏅᎯ ᎤᎵᏦᏛ ᏴᏫ ᎠᏁᎲ ᎤᏓᏑᏯ, ᎠᎴ ᎤᏁᎳᏅᎯ ᎾᏍᎩ ᎠᏁᎲ ᏛᏕᏂ, ᎠᎴ ᎾᏍᎩ ᏧᏤᎵ ᎨᏎᏍᏗ ᏴᏫ, ᎤᏁᎳᏅᎯᏃ ᎤᏩᏒ ᎾᏍᎩ ᎠᏁᎲ ᎡᎮᏍᏗ ᎤᎾᏤᎵ ᎤᏁᎳᏅᎯ ᎨᏎᏍᏗ.

source: And he will put an end to all their weeping; and there will be no more death, or sorrow, or crying, or pain; for the first things have come to an end.
chr: ᎠᎴ ᎤᏁᎳᏅᎯ ᏙᏓᎦᏅᎦᎸᎯ ᏂᎦᏛ ᏓᏂᎦᏌᏬᎢᎲᎢ; ᎥᏝ ᎠᎴ ᎿᏉ ᏰᎮᏍᏗ ᎠᏲᎱᎯᏍᏗ, ᎠᎴ ᎤᏲ ᎠᏰᎸᏗ ᎨᏒ, ᎠᎴ ᏗᏠᏯᏍᏗ ᎨᏒᎢ, ᎥᏝ ᎠᎴ ᎿᏉ ᏰᎮᏍᏗ ᎡᎯᏍᏗ ᎨᏒᎢ; ᎢᎬᏱᏱᏰᏃ ᏧᏓᎴᏅᏛ ᏤᎲ ᎤᎶᏐᏅ.

source: And he who is seated on the high seat said, See, I make all things new. And he said, Put it in the book; for these words are certain and true.
chr: ᎦᏍᎩᎸᏃ ᎤᏬᎵ, ᎯᎠ ᏄᏪᏒᎩ, ᎬᏂᏳᏉ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ ᎢᏤ ᏂᎬᏁᎭ. ᎠᎴ ᎯᎠ ᎾᎩᏪᏎᎸᎩ, ᎰᏪᎸᎦ; ᎯᎠᏰᏃ ᎾᏍᎩ ᎧᏃᎮᏛ ᎬᏜᏏᏛᎡᏗ ᏂᎨᏒᎾ ᎠᎴ ᎤᏙᎯᏳᎯᏯ.

source: And he said to me, It is done. I am the First and the Last, the start and the end. I will freely give of the fountain of the water of life to him who is in need.
chr: ᎠᎴ ᎯᎠ ᎾᎩᏪᏎᎸᎩ; ᎾᏍᎩ ᏂᏌᎵᏍᏓ. ᎠᏴ ᎡᎵᏆ ᎠᎴ ᎣᎻᎦ, ᎢᎬᏱᏱ ᎨᏒ ᎠᎴ ᎤᎵᏍᏆᎸᏗ ᎨᏒᎢ. ᎤᏔᏕᎩᏍᎩ ᎠᎹ ᎬᏂᏛ ᎠᏓᏁᎯ ᎦᏄᎪᎬ ᏓᏥᏁᏁᎵ ᏧᎬᏩᎶᏗ ᏂᎨᏒᎾ.

source: He who overcomes will have these things for his heritage; and I will be his God, and he will be my son.
chr: ᎩᎶ ᎠᏓᏎᎪᎩᏍᎨᏍᏗ ᏂᎦᏗᏳ ᏧᏓᎴᏅᏛ ᎤᏤᎵ ᎢᏳᎵᏍᏙᏗ ᎨᏎᏍᏗ; ᎠᎴ ᎠᏴ ᏥᏯᏁᎳᏅᎯ ᎨᏎᏍᏗ, ᎤᏩᏒᏃ ᎠᏴ ᎠᏇᏥ ᎨᏎᏍᏗ.

source: But those who are full of fear and without faith, the unclean and takers of life, those who do the sins of the flesh, and those who make use of evil powers or who give worship to images, and all those who are false, will have their part in the sea of ever-burning fire which is the second death.
chr: ᎤᏂᏍᎦᎡᎾᏍᎩᏂ. ᎠᎴ ᏄᏃᎯᏳᏒᎾ, ᎠᎴ ᎤᏂᏍᎦᎢᏍᏗ, ᎠᎴ ᏗᎾᏓᎯᎯ, ᎠᎴ ᎤᏂᏁᎫᏥᏛ, ᎠᎴ ᏗᎾᏙᏂᏍᎩ, ᎠᎴ ᎤᏁᎳᏅᎯ ᏗᏰᎸᎯ ᏗᎾᏓᏙᎵᏍᏓᏁᎯ, ᎠᎴ ᏂᎦᏗᏳ ᎠᏂᏰᎪᎩ, ᎤᎾᏤᎵ ᎢᎨᎬᏁᏗ ᎨᏎᏍᏗ ᎥᏓᎸ ᎾᎿ ᎠᏓᏪᎵᎩᏍᎬ ᎠᏥᎸ ᎠᎴ ᏌᎪᏂᎨ ᎠᏓᏪᎵᎩᏍᎩ; ᎾᏍᎩ ᏔᎵᏁ ᎠᏲᎱᎯᏍᏗ ᏥᎩ.

source: And one of the seven angels who had the seven vessels in which were the seven last punishments, came and said to me, Come here, and see the bride, the Lamb's wife.
chr: ᎠᎩᎷᏤᎸᎩᏃ ᎠᏏᏴᏫ ᎾᏍᎩ Ꮎ ᎦᎵᏉᎩ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ, ᎾᏍᎩ ᏥᏓᏂᏰᎲᎩ ᏚᎵᏉᎩ ᎫᎫ ᎦᎵᏉᎩ ᎤᎵᏍᏆᎸᏗ ᎤᏕᏯᏙᏗ ᏗᏟᏍᏗ, ᎠᎴ ᎠᏆᎵᏃᎮᏔᏅᎩ, ᎯᎠ ᏄᏪᏒᎩ; ᎡᎮᎾ, ᏓᎬᏯᏎᎮᎵᏃ ᎠᏥᏰᎯ ᎤᏃᏕᎾ ᎠᎩᎾ ᎤᏓᎵᎢ.

source: And he took me away in the Spirit to a great and high mountain, and let me see the holy town Jerusalem, coming down out of heaven from God,
chr: ᎠᏆᏘᎾᏫᏛᎲᎩᏃ ᏗᏆᏓᏅᏛ ᎡᏆ ᎠᎴ ᎢᏅ ᎢᎦᏘ ᏦᏓᎸᎢ ᏩᏆᏘᏅᏍᏔᏅᎩ, ᎠᎴ ᎠᎩᎾᏄᎪᏫᏎᎸᎩ Ꮎ ᎡᏆ ᎦᏚᎲᎢ, ᎾᏍᎩ ᎦᎸᏉᏗ ᏥᎷᏏᎵᎻ, ᎡᎳᏗ ᏅᏓᏳᏍᏗᏗᏒᎩ ᎦᎸᎳᏗ ᎤᏁᎳᏅᎯᏱ ᏛᏓᎴᎲᏍᎬᎩ.

source: Having the glory of God: and her light was like a stone of great price, a jasper stone, clear as glass:
chr: ᎦᎸᏉᏗᏳ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵᎦ ᎤᏣᏃᏛᎩ; ᎠᎴ ᎾᏍᎩ ᏚᎸᏌᏛ, ᏅᏯ ᎤᏣᏘ ᏧᎬᏩᎶᏗ ᎾᏍᎩᏯ ᎨᏒᎩ, ᎾᏍᎩ ᏣᏍᏆ ᏅᏯ ᎾᏍᎩᏯᎢ ᏗᎬᏩᎸᏌᏛ ᎨᏒᎩ.

source: She had a wall great and high, with twelve doors, and at the doors twelve angels; and names on them, which are the names of the twelve tribes of the children of Israel.
chr: ᎠᏐᏴᎩᏃ ᎡᏆ ᎢᏅ ᎢᎦᏘ, ᎦᎶᎯᏍᏗᏱᏃ ᏔᎳᏚ ᏕᎪᏢᏒᎩ, ᎠᎴ ᎦᎶᎯᏍᏗᏱ ᏔᎳᏚ ᎢᏯᏂᏛ ᏗᏂᎧᎿᏩᏗᏙᎯ [ᏓᏂᏙᎬᎩ,] ᏚᎾᏙᎥᏃ ᏕᎪᏪᎸᎩ ᎦᎶᎯᏍᏗᏱ, ᎾᏍᎩ ᏔᎳᏚ ᎾᏂᎳᏍᏓᎸ ᎢᏏᎵ ᏧᏪᏥ ᏚᎾᏙᎥᎢ.

source: And on the east were three doors; and on the north three doors; and on the south three doors; and on the west three doors.
chr: ᏅᏙ ᏗᎧᎸᎬ ᎢᏗᏢ ᏦᎢ ᎦᎶᎯᏍᏗᏱ [ᏕᎪᏢᏒᎩ,] ᏧᏴᏢᏃ ᎢᏗᏢ ᏦᎢ ᎦᎶᎯᏍᏗᏱ; ᏧᎦᎾᏮᏃ ᎢᏗᏢ ᏦᎢ ᎦᎶᎯᏍᏗᏱ; ᏭᏕᎵᎬᏃ ᎢᏗᏢ ᏦᎢ ᎦᎶᎯᏍᏗᏱ.

source: And the wall of the town had twelve bases, and on them the twelve names of the twelve Apostles of the Lamb.
chr: ᎠᏐᏴᏃ ᎦᏚᎲ ᏔᎳᏚ ᏕᎦᎫᏍᏓᎥᎩ, ᏕᎦᎫᏍᏓᎥᏃ ᏔᎳᏚ ᏚᎾᏙᎥᎢ [ᏕᎪᏪᎸᎩ,] ᎾᏍᎩ ᏔᎳᏚ ᎢᏯᏂᏛ ᎤᏃᏕᎾ ᎠᎩᎾ ᏧᏅᏏᏛ ᏚᎾᏙᎥᎢ.

source: And he who was talking with me had a gold measuring-rod to take the measure of the town, and of its doors, and its wall.
chr: ᎾᏍᎩᏃ ᎠᏆᎵᏃᎮᏔᏅᎯ ᎦᏁᎲᎩ ᎠᏕᎸᏓᎶᏂᎨ ᎠᏢᏔᏅᎯ ᎠᏟᎶᏍᏗ, ᎦᏚᎲ ᎠᏟᎶᏍᏗ, ᎠᎴ ᎦᎶᎯᏍᏗᏱ ᏗᏟᎶᏍᏗ, ᎠᎴ ᎠᏐᏴ ᎠᏟᎶᏍᏗ.

source: And the town is square, as wide as it is long; and he took the measure of the town with the rod, one thousand and five hundred miles: it is equally long and wide and high.
chr: ᎦᏚᎲᏃ ᏅᎩ ᏧᏅᏏᏴ ᎨᏒᎩ, ᎦᏅᎯᏒ ᎠᎴ ᎠᏯᏛᎥ ᎤᏠᏱᏉ ᎨᏒᎩ. ᎤᏟᎶᎥᎩᏃ ᎦᏚᎲ ᎤᏩᏔᏅᎩ ᎠᏟᎶᏍᏗ, ᎯᏍᎩᎦᏚ ᎢᏯᏍᎪᎯᏧᏈ ᎢᏳᏟᎶᏛ ᏂᎬᎩ. ᏂᎦᏅᎯᏒ ᎠᎴ ᎾᏯᏛᎲ ᎠᎴ ᏂᎦᏛᎢ ᎤᏠᏱᏉ ᎨᏒᎩ.

source: And he took the measure of its wall, one hundred and forty-four cubits, after the measure of a man, that is, of an angel.
chr: ᎠᏎᏴᏃ ᎤᏟᎶᎥᎩ ᎠᏍᎪᎯᏧᏈ ᏅᎦᏍᎪᎯ ᏅᎩᎦᎵ ᎢᏯᎩᏳᏍᏈᏛ ᎤᏟᎶᎥᎩ, ᎾᏍᎩ ᏴᏫ ᎤᏟᎶᏍᏗ ᎢᎦᏅᎯᏛ, ᎾᏍᎩ ᏗᎧᎿᏩᏗᏙᎯ ᎤᏟᎶᏍᏗ.

source: And the building of its wall was of jasper, and the town was clear gold, clear as glass.
chr: ᎠᏐᏴᏃ ᏣᏍᏆ ᏅᏯ ᎠᏁᏍᎨᏛᎩ; ᎦᏚᎲᏃ ᎪᎱᏍᏗ ᎾᏑᏴᎾ ᎠᏕᎸ ᏓᎶᏂᎨ ᎪᏢᏛᎩ, ᏧᎸᏌᏛ ᎠᏓᎨᏗ ᎾᏍᎩᏯᎢ.

source: The bases of the wall of the town had ornaments of all sorts of beautiful stones. The first base was jasper; the second, sapphire; the third, chalcedony; the fourth, emerald;
chr: ᏕᎦᎫᏍᏓᎥᏃ ᎠᏐᏴ ᎦᏚᎲᎢ ᏕᎪᏚᎢᏍᏛᎩ ᏄᏓᎴᏒ ᏗᎦᎸᏉᏗ ᏅᏯ; ᎢᎬᏱᏱ ᎦᎫᏍᏓᎥ ᏣᏍᏆ ᎨᏒᎩ, ᏔᎵᏁᏃ ᏌᏆᏯ, ᏦᎢᏁᏃ ᎦᎵᏏᏙᏂ, ᏅᎩᏁᏃ ᎡᎻᎳ,

source: The fifth, sardonyx; the sixth, sardius; the seventh, chrysolite; the eighth, beryl; the ninth, topaz; the tenth, chrysoprase; the eleventh, jacinth; the twelfth, amethyst.
chr: ᎯᏍᎩᏃ ᏌᏙᏂᎩ, ᏑᏓᎵᏁᏃ ᏌᏗᏱ, ᎦᎵᏉᎩᏁᏃ ᎩᏐᎳᏗ, ᏧᏁᎵᏁᏃ ᏇᎵ, ᏐᎣᏁᎵᏁᏃ ᏙᏆᏏ, ᎠᏍᎪᎯᏁᏃ ᏟᏌᏇᏌ, ᏌᏚᏏᏁᏃ ᏤᏏᏂ, ᏔᎳᏚᏏᏁᏃ ᎠᎻᏗᏏ.

source: And the twelve doors were twelve pearls; every door was made of one pearl; and the street of the town was clear gold, as clear as glass.
chr: ᏔᎳᏚᏃ ᏕᎪᏢᏒ ᏗᏍᏚᏗ ᏔᎳᏚ ᏓᎬᎾᎢᏳᎾᏍᏗ ᏕᎪᏢᏛᎩ; ᏌᏉ ᎠᏍᏚᏗ ᏌᏉ ᏓᎬᎾᎢᏳᏍᏗ ᎪᏢᏛᎩ ᎡᏓᏍᏗᏱ ᎤᏜᏅᏛ ᎦᏚᎲ ᎪᎱᏍᏗ ᎾᏑᏴᎾ ᎠᏕᎸ ᏓᎶᏂᎨ ᎠᏢᏛᎩ, ᏧᎸᏌᏛ ᎠᏓᎨᏗ ᎾᏍᎩᏯᎢ.

source: And I saw no Temple there; because the Lord God, the Ruler of all, and the Lamb are its Temple.
chr: ᎥᏝ ᎠᎴ ᏯᎩᎪᎮ ᎾᎿ ᏗᎦᎳᏫᎢᏍᏗᏱ; ᎤᎬᏫᏳᎯᏰᏃ ᎤᏁᎳᏅᎯ ᏫᎾᏍᏛᎾ ᎤᎵᏂᎩᏛ ᎠᎴ ᎤᏃᏕᎾ-ᎠᎩᎾ ᎾᏍᎩ ᏗᎦᎳᏫᎢᏍᏗᏱ ᎢᎩ.

source: And the town has no need of the sun, or of the moon, to give it light: for the glory of God did make it light, and the light of it is the Lamb.
chr: ᎦᏚᎲᏃ ᎥᏝ ᏳᎾᏚᎵ ᏅᏙ-ᎢᎦ-ᎡᎯ ᎠᎴ ᏅᏙ-ᎡᏃᏱ-ᎡᎯ ᎤᎦᎵᎯᏍᏗᏱ ᎾᎿᏂ; ᎦᎸᏉᏗᏳᏰᏃ ᎨᏒ ᎤᏁᎳᏅᎯ ᎤᏤᎵ ᎢᎦ ᎤᏘᏍᏛ ᎾᎿᏂ, ᎠᎴ ᎤᏃᏕᎾ-ᎠᎩᎾ ᎢᎦ ᎠᏘᏍᏗᏍᎩ ᎢᎩ ᎾᎿᏂ.

source: And the nations will go in its light: and the kings of the earth will take their glory into it.
chr: ᏧᎾᏓᎴᏅᏛᏃ ᏴᏫ ᎾᏍᎩ ᎨᏥᏍᏕᎸᏛ ᎨᏒ ᎾᏍᎩ ᏚᎸᏌᏛ ᎠᏁᏙᎮᏍᏗ; ᎤᏂᎬᏫᏳᏃ ᎡᎶᎯ ᎠᏁᎯ ᎾᎿ ᎠᏂᏴᎯᎭ ᎨᏥᎸᏉᏛ ᎠᎴ ᏧᎾᏤᎵ ᏧᏓᎴᏅᏛ ᏗᎦᎸᏉᏗ.

source: And the doors of it will never be shut by day (for there is no night there):
chr: ᎠᎴ ᎦᎶᎯᏍᏗᏱ ᎾᎿ ᏕᎪᏢᏒ ᎥᏝ ᏧᏂᏍᏚᏗ ᏱᎨᏎᏍᏗ ᎢᎦ, ᎥᏝᏰᏃ ᏒᏃᏱ ᏱᎨᏎᏍᏗ ᎾᎿᏂ.

source: And the glory and honour of the nations will come into it:
chr: ᎠᎴ ᎾᎿ ᎠᏂᏲᎯᎮᏍᏗ ᏧᎾᏓᎴᏅᏛ ᎠᏴ ᎤᎾᏤᎵ ᎦᎸᏉᏗᏳ ᎨᏒ ᎠᎴ ᏣᏓᎴᏅᏛ ᏗᎦᎸᏉᏗ.

source: And nothing unclean may come into it, or anyone whose works are cursed or false; but only those whose names are in the Lamb's book of life.
chr: ᎠᎴ ᎥᏝ ᎠᏎ ᎾᎿ ᎤᏴᏍᏗ ᏱᎨᏎᏍᏗ ᎪᎱᏍᏗ ᎦᏓᎭ, ᎠᎴ ᎤᏂᏆᏘᏍᏗ ᏧᎸᏫᏍᏓᏁᎯ, ᎠᎴ ᎦᏰᎪᎩ; ᎤᏅᏒᏍᎩᏂ [ᎤᏂᏴᏍᏗ ᎨᏎᏍᏗ ᏚᎾᏙᎥ] ᏗᎪᏪᎵ ᎬᏂᏛ ᎠᏓᏁᎯ ᎪᏪᎵᎯ ᎤᏃᏕᎾᎠᎩᎾ ᎤᏤᎵᎦ.
